package com.the703.basic007_ex;

public class For2Ex011 {
	public static void main(String[] args) {
		
//		1~10, 11~20 누적합
//		이중 for, 이중 while, 이중 do while 세가지 버젼으로 다음과 같이 출력하시오. 
//		1 + ... + 10 = 55
//		11 + ... + 20 = 155
//		21 + ... + 30 = 255
//		31 + ... + 40 = 355
//		41 + ... + 50 = 455
//		51 + ... + 60 = 555
//		61 + ... + 70 = 655
//		71 + ... + 80 = 755
//		81 + ... + 90 = 855
//		91 + ... + 100 = 955
		
//		((10*0)+1) + ((10*0)+2) + ((10*0)+3) + ((10*0)+4) + ((10*0)+5) + ((10*0)+6) + ((10*0)+7) + ((10*0)+8) + ((10*0)+9) + ((10*0)+10) =  55
//		((10*1)+1) + ((10*1)+2) + ((10*1)+3) + ((10*1)+4) + ((10*1)+5) + ((10*1)+6) + ((10*1)+7) + ((10*1)+8) + ((10*1)+9) + ((10*1)+10) = 155
//		((10*2)+1) + ((10*2)+2) + ((10*2)+3) + ((10*2)+4) + ((10*2)+5) + ((10*2)+6) + ((10*2)+7) + ((10*2)+8) + ((10*2)+9) + ((10*2)+10) = 255
		
//		((10*ch)+i) + ((10*ch)+i) + ((10*ch)+i) + ((10*ch)+i) + ((10*ch)+i) + ((10*ch)+i) + ((10*ch)+i) + ((10*ch)+i) + ((10*ch)+i) + ((10*ch)+i) =  55
		
		// 이중 for 		
		int hap=0;
		
		for(int ch=0; ch<10; ch++) {
			for(int i=1; i<=10; i++) {
				System.out.print( ( i==1 ? "" : "+" ) + ((ch*10)+i) );			
				hap+=((ch*10)+i);			
			}
			System.out.println("="+hap);	
			hap=0;			
		}	
		
		// 이중 while 	
		System.out.println();
		int hap1=0;
		
		int ch=0;
		while( ch<10 ) {
			int i=1;
			while( i<=10 ) {
				System.out.printf( ( i==1 ? "" : "+" ) + ((ch*10)+i) );			
				hap1+=((ch*10)+i);	
				i++;
			}
			System.out.println("="+hap1);	
			hap1=0;		
			ch++;
		}
		
		// 이중 do while 	
		System.out.println();
		int hap2=0;
		
		int ch1=0;
		do{
			int i=1;
			do{
				System.out.printf( ( i==1 ? "" : "+" ) + ((ch1*10)+i) );			
				hap2+=((ch1*10)+i);	
				i++;
			}while( i<=10 );
			System.out.println("="+hap2);	
			hap2=0;		
			ch1++;
		}while( ch1<10 );		

	}
}