package com.the703.basic007_ex;

public class For2Ex012 {
	public static void main(String[] args) {
		
//		1~10, 11~20 누적합
//		이중 for, 이중 while, 이중 do while 세가지 버젼으로 다음과 같이 출력하시오. 
//		1+2+3+4+5+6+7+8+9+10 = 55
//		1+2+3+4+5+6+7+8+9+10+11+12+13+14+15+16+17+18+19+20 = 210
//		... 중간생략 
//		1+2+3+4+5+6+7+8+9+10+11+12+13+14+15+16+17+18+19...중간생략+100 = 5050
		
//		(1*1)+2+3+4+5+6+7+8+9+(1*10) = 55
//		(2*1)+2+3+4+5+6+7+8+9+10+11+12+13+14+15+16+17+18+19+(2*10) = 210
//		... 중간생략 
//		(10*1)+2+3+4+5+6+7+8+9+10+11+12+13+14+15+16+17+18+19...중간생략+(10*10) = 5050
		
		int hap=0;
		
		for(int ch=1; ch<=10; ch++) {
			for(int i=1; i<=(10*ch); i++) {
				System.out.print( (i==1 ? "" :"+") + i);
				hap+=i;
			}
			System.out.println("="+hap);	
			hap=0;
		}
		

			
//			for(int i=1; i<=(10*2); i++) {
//				System.out.print( (i==1 ? "" :"+") + i);
//				hap+=i;
//			}
//			System.out.println("="+hap);

		
		


	}
}
